SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ecaif.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 ECAIF register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_ECAIF_H
#define EFR32FG25_ECAIF_H
#define ECAIF_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_ECAIF ECAIF
 * @{
 * @brief EFR32FG25 ECAIF Register Declaration.
 *****************************************************************************/

/** ECAIF FIFOIN Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFOIN;                             /**< New Register                                       */
} ECAIF_FIFOIN_TypeDef;

/** ECAIF FMTIN Register Group Declaration. */
typedef struct {
  uint32_t RESERVED0[1U];                            /**< Reserved for future use                            */
} ECAIF_FMTIN_TypeDef;

/** ECAIF Register Declaration. */
typedef struct {
  __IM uint32_t        IPVERSION;               /**< IP Version ID                                      */
  __IOM uint32_t       EN;                      /**< Module Enable                                      */
  __IOM uint32_t       SWRST;                   /**< Software Reset                                     */
  __IOM uint32_t       CONNECT;                 /**< New Register                                       */
  __IOM uint32_t       DISCLK;                  /**< New Register                                       */
  uint32_t             RESERVED0[3U];           /**< Reserved for future use                            */
  ECAIF_FIFOIN_TypeDef FIFOIN[2U];              /**<                                                    */
  uint32_t             RESERVED1[6U];           /**< Reserved for future use                            */
  uint32_t             RESERVED2[1U];           /**< Reserved for future use                            */
  uint32_t             RESERVED3[23U];          /**< Reserved for future use                            */
  ECAIF_FMTIN_TypeDef  FMTIN[2U];               /**<                                                    */
  uint32_t             RESERVED4[6U];           /**< Reserved for future use                            */
  uint32_t             RESERVED5[1U];           /**< Reserved for future use                            */
  uint32_t             RESERVED6[79U];          /**< Reserved for future use                            */
  __IOM uint32_t       CTRL;                    /**< New Register                                       */
  uint32_t             RESERVED7[895U];         /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_SET;           /**< IP Version ID                                      */
  __IOM uint32_t       EN_SET;                  /**< Module Enable                                      */
  __IOM uint32_t       SWRST_SET;               /**< Software Reset                                     */
  __IOM uint32_t       CONNECT_SET;             /**< New Register                                       */
  __IOM uint32_t       DISCLK_SET;              /**< New Register                                       */
  uint32_t             RESERVED8[3U];           /**< Reserved for future use                            */
  ECAIF_FIFOIN_TypeDef FIFOIN_SET[2U];          /**<                                                    */
  uint32_t             RESERVED9[6U];           /**< Reserved for future use                            */
  uint32_t             RESERVED10[1U];          /**< Reserved for future use                            */
  uint32_t             RESERVED11[23U];         /**< Reserved for future use                            */
  ECAIF_FMTIN_TypeDef  FMTIN_SET[2U];           /**<                                                    */
  uint32_t             RESERVED12[6U];          /**< Reserved for future use                            */
  uint32_t             RESERVED13[1U];          /**< Reserved for future use                            */
  uint32_t             RESERVED14[79U];         /**< Reserved for future use                            */
  __IOM uint32_t       CTRL_SET;                /**< New Register                                       */
  uint32_t             RESERVED15[895U];        /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_CLR;           /**< IP Version ID                                      */
  __IOM uint32_t       EN_CLR;                  /**< Module Enable                                      */
  __IOM uint32_t       SWRST_CLR;               /**< Software Reset                                     */
  __IOM uint32_t       CONNECT_CLR;             /**< New Register                                       */
  __IOM uint32_t       DISCLK_CLR;              /**< New Register                                       */
  uint32_t             RESERVED16[3U];          /**< Reserved for future use                            */
  ECAIF_FIFOIN_TypeDef FIFOIN_CLR[2U];          /**<                                                    */
  uint32_t             RESERVED17[6U];          /**< Reserved for future use                            */
  uint32_t             RESERVED18[1U];          /**< Reserved for future use                            */
  uint32_t             RESERVED19[23U];         /**< Reserved for future use                            */
  ECAIF_FMTIN_TypeDef  FMTIN_CLR[2U];           /**<                                                    */
  uint32_t             RESERVED20[6U];          /**< Reserved for future use                            */
  uint32_t             RESERVED21[1U];          /**< Reserved for future use                            */
  uint32_t             RESERVED22[79U];         /**< Reserved for future use                            */
  __IOM uint32_t       CTRL_CLR;                /**< New Register                                       */
  uint32_t             RESERVED23[895U];        /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_TGL;           /**< IP Version ID                                      */
  __IOM uint32_t       EN_TGL;                  /**< Module Enable                                      */
  __IOM uint32_t       SWRST_TGL;               /**< Software Reset                                     */
  __IOM uint32_t       CONNECT_TGL;             /**< New Register                                       */
  __IOM uint32_t       DISCLK_TGL;              /**< New Register                                       */
  uint32_t             RESERVED24[3U];          /**< Reserved for future use                            */
  ECAIF_FIFOIN_TypeDef FIFOIN_TGL[2U];          /**<                                                    */
  uint32_t             RESERVED25[6U];          /**< Reserved for future use                            */
  uint32_t             RESERVED26[1U];          /**< Reserved for future use                            */
  uint32_t             RESERVED27[23U];         /**< Reserved for future use                            */
  ECAIF_FMTIN_TypeDef  FMTIN_TGL[2U];           /**<                                                    */
  uint32_t             RESERVED28[6U];          /**< Reserved for future use                            */
  uint32_t             RESERVED29[1U];          /**< Reserved for future use                            */
  uint32_t             RESERVED30[79U];         /**< Reserved for future use                            */
  __IOM uint32_t       CTRL_TGL;                /**< New Register                                       */
} ECAIF_TypeDef;
/** @} End of group EFR32FG25_ECAIF */

/**************************************************************************//**
 * @addtogroup EFR32FG25_ECAIF
 * @{
 * @defgroup EFR32FG25_ECAIF_BitFields ECAIF Bit Fields
 * @{
 *****************************************************************************/

