SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ecaif.h
/* Bit fields for ECAIF IPVERSION */
#define _ECAIF_IPVERSION_RESETVALUE           0x00000001UL                              /**< Default value for ECAIF_IPVERSION           */
#define _ECAIF_IPVERSION_MASK                 0xFFFFFFFFUL                              /**< Mask for ECAIF_IPVERSION                    */
#define _ECAIF_IPVERSION_IPVERSION_SHIFT      0                                         /**< Shift value for ECAIF_IPVERSION             */
#define _ECAIF_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                              /**< Bit mask for ECAIF_IPVERSION                */
#define _ECAIF_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                              /**< Mode DEFAULT for ECAIF_IPVERSION            */
#define ECAIF_IPVERSION_IPVERSION_DEFAULT     (_ECAIF_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for ECAIF_IPVERSION    */

/* Bit fields for ECAIF EN */
#define _ECAIF_EN_RESETVALUE                  0x00000000UL                              /**< Default value for ECAIF_EN                  */
#define _ECAIF_EN_MASK                        0x00000003UL                              /**< Mask for ECAIF_EN                           */
#define ECAIF_EN_EN                           (0x1UL << 0)                              /**< Module Enable                               */
#define _ECAIF_EN_EN_SHIFT                    0                                         /**< Shift value for ECAIF_EN                    */
#define _ECAIF_EN_EN_MASK                     0x1UL                                     /**< Bit mask for ECAIF_EN                       */
#define _ECAIF_EN_EN_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for ECAIF_EN                   */
#define ECAIF_EN_EN_DEFAULT                   (_ECAIF_EN_EN_DEFAULT << 0)               /**< Shifted mode DEFAULT for ECAIF_EN           */
#define ECAIF_EN_DISABLING                    (0x1UL << 1)                              /**< Disablement Busy Status                     */
#define _ECAIF_EN_DISABLING_SHIFT             1                                         /**< Shift value for ECAIF_DISABLING             */
#define _ECAIF_EN_DISABLING_MASK              0x2UL                                     /**< Bit mask for ECAIF_DISABLING                */
#define _ECAIF_EN_DISABLING_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for ECAIF_EN                   */
#define ECAIF_EN_DISABLING_DEFAULT            (_ECAIF_EN_DISABLING_DEFAULT << 1)        /**< Shifted mode DEFAULT for ECAIF_EN           */

/* Bit fields for ECAIF SWRST */
#define _ECAIF_SWRST_RESETVALUE               0x00000000UL                              /**< Default value for ECAIF_SWRST               */
#define _ECAIF_SWRST_MASK                     0x00000003UL                              /**< Mask for ECAIF_SWRST                        */
#define ECAIF_SWRST_SWRST                     (0x1UL << 0)                              /**< Software Reset Command                      */
#define _ECAIF_SWRST_SWRST_SHIFT              0                                         /**< Shift value for ECAIF_SWRST                 */
#define _ECAIF_SWRST_SWRST_MASK               0x1UL                                     /**< Bit mask for ECAIF_SWRST                    */
#define _ECAIF_SWRST_SWRST_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for ECAIF_SWRST                */
#define ECAIF_SWRST_SWRST_DEFAULT             (_ECAIF_SWRST_SWRST_DEFAULT << 0)         /**< Shifted mode DEFAULT for ECAIF_SWRST        */
#define ECAIF_SWRST_RESETTING                 (0x1UL << 1)                              /**< Software Reset Busy Status                  */
#define _ECAIF_SWRST_RESETTING_SHIFT          1                                         /**< Shift value for ECAIF_RESETTING             */
#define _ECAIF_SWRST_RESETTING_MASK           0x2UL                                     /**< Bit mask for ECAIF_RESETTING                */
#define _ECAIF_SWRST_RESETTING_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for ECAIF_SWRST                */
#define ECAIF_SWRST_RESETTING_DEFAULT         (_ECAIF_SWRST_RESETTING_DEFAULT << 1)     /**< Shifted mode DEFAULT for ECAIF_SWRST        */

/* Bit fields for ECAIF CONNECT */
#define _ECAIF_CONNECT_RESETVALUE             0x00000000UL                              /**< Default value for ECAIF_CONNECT             */
#define _ECAIF_CONNECT_MASK                   0x00000003UL                              /**< Mask for ECAIF_CONNECT                      */
#define _ECAIF_CONNECT_IN_SHIFT               0                                         /**< Shift value for ECAIF_IN                    */
#define _ECAIF_CONNECT_IN_MASK                0x3UL                                     /**< Bit mask for ECAIF_IN                       */
#define _ECAIF_CONNECT_IN_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECAIF_CONNECT              */
#define ECAIF_CONNECT_IN_DEFAULT              (_ECAIF_CONNECT_IN_DEFAULT << 0)          /**< Shifted mode DEFAULT for ECAIF_CONNECT      */

/* Bit fields for ECAIF DISCLK */
#define _ECAIF_DISCLK_RESETVALUE              0x00000000UL                              /**< Default value for ECAIF_DISCLK              */
#define _ECAIF_DISCLK_MASK                    0x00000003UL                              /**< Mask for ECAIF_DISCLK                       */
#define _ECAIF_DISCLK_DISCLK_SHIFT            0                                         /**< Shift value for ECAIF_DISCLK                */
#define _ECAIF_DISCLK_DISCLK_MASK             0x3UL                                     /**< Bit mask for ECAIF_DISCLK                   */
#define _ECAIF_DISCLK_DISCLK_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for ECAIF_DISCLK               */
#define _ECAIF_DISCLK_DISCLK_NONE             0x00000000UL                              /**< Mode NONE for ECAIF_DISCLK                  */
#define _ECAIF_DISCLK_DISCLK_ALL              0x00000001UL                              /**< Mode ALL for ECAIF_DISCLK                   */
#define _ECAIF_DISCLK_DISCLK_NOTUSED          0x00000003UL                              /**< Mode NOTUSED for ECAIF_DISCLK               */
#define ECAIF_DISCLK_DISCLK_DEFAULT           (_ECAIF_DISCLK_DISCLK_DEFAULT << 0)       /**< Shifted mode DEFAULT for ECAIF_DISCLK       */
#define ECAIF_DISCLK_DISCLK_NONE              (_ECAIF_DISCLK_DISCLK_NONE << 0)          /**< Shifted mode NONE for ECAIF_DISCLK          */
#define ECAIF_DISCLK_DISCLK_ALL               (_ECAIF_DISCLK_DISCLK_ALL << 0)           /**< Shifted mode ALL for ECAIF_DISCLK           */
#define ECAIF_DISCLK_DISCLK_NOTUSED           (_ECAIF_DISCLK_DISCLK_NOTUSED << 0)       /**< Shifted mode NOTUSED for ECAIF_DISCLK       */

