SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ecaif.h
/* Bit fields for ECAIF FIFOIN */
#define _ECAIF_FIFOIN_RESETVALUE              0x00000000UL                              /**< Default value for ECAIF_FIFOIN              */
#define _ECAIF_FIFOIN_MASK                    0x1FFF3F0FUL                              /**< Mask for ECAIF_FIFOIN                       */
#define _ECAIF_FIFOIN_FID_SHIFT               0                                         /**< Shift value for ECAIF_FID                   */
#define _ECAIF_FIFOIN_FID_MASK                0xFUL                                     /**< Bit mask for ECAIF_FID                      */
#define _ECAIF_FIFOIN_FID_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECAIF_FIFOIN               */
#define ECAIF_FIFOIN_FID_DEFAULT              (_ECAIF_FIFOIN_FID_DEFAULT << 0)          /**< Shifted mode DEFAULT for ECAIF_FIFOIN       */
#define _ECAIF_FIFOIN_CID_SHIFT               8                                         /**< Shift value for ECAIF_CID                   */
#define _ECAIF_FIFOIN_CID_MASK                0x3F00UL                                  /**< Bit mask for ECAIF_CID                      */
#define _ECAIF_FIFOIN_CID_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECAIF_FIFOIN               */
#define ECAIF_FIFOIN_CID_DEFAULT              (_ECAIF_FIFOIN_CID_DEFAULT << 8)          /**< Shifted mode DEFAULT for ECAIF_FIFOIN       */
#define _ECAIF_FIFOIN_REM_SHIFT               16                                        /**< Shift value for ECAIF_REM                   */
#define _ECAIF_FIFOIN_REM_MASK                0xFF0000UL                                /**< Bit mask for ECAIF_REM                      */
#define _ECAIF_FIFOIN_REM_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECAIF_FIFOIN               */
#define ECAIF_FIFOIN_REM_DEFAULT              (_ECAIF_FIFOIN_REM_DEFAULT << 16)         /**< Shifted mode DEFAULT for ECAIF_FIFOIN       */
#define _ECAIF_FIFOIN_ALARM_SHIFT             24                                        /**< Shift value for ECAIF_ALARM                 */
#define _ECAIF_FIFOIN_ALARM_MASK              0x1F000000UL                              /**< Bit mask for ECAIF_ALARM                    */
#define _ECAIF_FIFOIN_ALARM_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for ECAIF_FIFOIN               */
#define ECAIF_FIFOIN_ALARM_DEFAULT            (_ECAIF_FIFOIN_ALARM_DEFAULT << 24)       /**< Shifted mode DEFAULT for ECAIF_FIFOIN       */

/* Bit fields for ECAIF CTRL */
#define _ECAIF_CTRL_RESETVALUE                0x00040002UL                              /**< Default value for ECAIF_CTRL                */
#define _ECAIF_CTRL_MASK                      0x003FFFFFUL                              /**< Mask for ECAIF_CTRL                         */
#define ECAIF_CTRL_RST                        (0x1UL << 0)                              /**< New BitField                                */
#define _ECAIF_CTRL_RST_SHIFT                 0                                         /**< Shift value for ECAIF_RST                   */
#define _ECAIF_CTRL_RST_MASK                  0x1UL                                     /**< Bit mask for ECAIF_RST                      */
#define _ECAIF_CTRL_RST_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define ECAIF_CTRL_RST_DEFAULT                (_ECAIF_CTRL_RST_DEFAULT << 0)            /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define _ECAIF_CTRL_OUTDIV_SHIFT              1                                         /**< Shift value for ECAIF_OUTDIV                */
#define _ECAIF_CTRL_OUTDIV_MASK               0x1EUL                                    /**< Bit mask for ECAIF_OUTDIV                   */
#define _ECAIF_CTRL_OUTDIV_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define ECAIF_CTRL_OUTDIV_DEFAULT             (_ECAIF_CTRL_OUTDIV_DEFAULT << 1)         /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define _ECAIF_CTRL_SELIRQ_SHIFT              5                                         /**< Shift value for ECAIF_SELIRQ                */
#define _ECAIF_CTRL_SELIRQ_MASK               0xE0UL                                    /**< Bit mask for ECAIF_SELIRQ                   */
#define _ECAIF_CTRL_SELIRQ_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define _ECAIF_CTRL_SELIRQ_S_1_0              0x00000000UL                              /**< Mode S_1_0 for ECAIF_CTRL                   */
#define _ECAIF_CTRL_SELIRQ_S_2_0              0x00000001UL                              /**< Mode S_2_0 for ECAIF_CTRL                   */
#define _ECAIF_CTRL_SELIRQ_S_3_0              0x00000002UL                              /**< Mode S_3_0 for ECAIF_CTRL                   */
#define _ECAIF_CTRL_SELIRQ_S_2_1              0x00000003UL                              /**< Mode S_2_1 for ECAIF_CTRL                   */
#define _ECAIF_CTRL_SELIRQ_S_3_1              0x00000004UL                              /**< Mode S_3_1 for ECAIF_CTRL                   */
#define _ECAIF_CTRL_SELIRQ_S_3_2              0x00000005UL                              /**< Mode S_3_2 for ECAIF_CTRL                   */
#define _ECAIF_CTRL_SELIRQ_EXTRA1             0x00000006UL                              /**< Mode EXTRA1 for ECAIF_CTRL                  */
#define _ECAIF_CTRL_SELIRQ_EXTRA2             0x00000007UL                              /**< Mode EXTRA2 for ECAIF_CTRL                  */
#define ECAIF_CTRL_SELIRQ_DEFAULT             (_ECAIF_CTRL_SELIRQ_DEFAULT << 5)         /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define ECAIF_CTRL_SELIRQ_S_1_0               (_ECAIF_CTRL_SELIRQ_S_1_0 << 5)           /**< Shifted mode S_1_0 for ECAIF_CTRL           */
#define ECAIF_CTRL_SELIRQ_S_2_0               (_ECAIF_CTRL_SELIRQ_S_2_0 << 5)           /**< Shifted mode S_2_0 for ECAIF_CTRL           */
#define ECAIF_CTRL_SELIRQ_S_3_0               (_ECAIF_CTRL_SELIRQ_S_3_0 << 5)           /**< Shifted mode S_3_0 for ECAIF_CTRL           */
#define ECAIF_CTRL_SELIRQ_S_2_1               (_ECAIF_CTRL_SELIRQ_S_2_1 << 5)           /**< Shifted mode S_2_1 for ECAIF_CTRL           */
#define ECAIF_CTRL_SELIRQ_S_3_1               (_ECAIF_CTRL_SELIRQ_S_3_1 << 5)           /**< Shifted mode S_3_1 for ECAIF_CTRL           */
#define ECAIF_CTRL_SELIRQ_S_3_2               (_ECAIF_CTRL_SELIRQ_S_3_2 << 5)           /**< Shifted mode S_3_2 for ECAIF_CTRL           */
#define ECAIF_CTRL_SELIRQ_EXTRA1              (_ECAIF_CTRL_SELIRQ_EXTRA1 << 5)          /**< Shifted mode EXTRA1 for ECAIF_CTRL          */
#define ECAIF_CTRL_SELIRQ_EXTRA2              (_ECAIF_CTRL_SELIRQ_EXTRA2 << 5)          /**< Shifted mode EXTRA2 for ECAIF_CTRL          */
#define _ECAIF_CTRL_SHIFT0_SHIFT              8                                         /**< Shift value for ECAIF_SHIFT0                */
#define _ECAIF_CTRL_SHIFT0_MASK               0x1F00UL                                  /**< Bit mask for ECAIF_SHIFT0                   */
#define _ECAIF_CTRL_SHIFT0_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define ECAIF_CTRL_SHIFT0_DEFAULT             (_ECAIF_CTRL_SHIFT0_DEFAULT << 8)         /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define _ECAIF_CTRL_SHIFT1_SHIFT              13                                        /**< Shift value for ECAIF_SHIFT1                */
#define _ECAIF_CTRL_SHIFT1_MASK               0x3E000UL                                 /**< Bit mask for ECAIF_SHIFT1                   */
#define _ECAIF_CTRL_SHIFT1_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define ECAIF_CTRL_SHIFT1_DEFAULT             (_ECAIF_CTRL_SHIFT1_DEFAULT << 13)        /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define _ECAIF_CTRL_SELDACI_SHIFT             18                                        /**< Shift value for ECAIF_SELDACI               */
#define _ECAIF_CTRL_SELDACI_MASK              0xC0000UL                                 /**< Bit mask for ECAIF_SELDACI                  */
#define _ECAIF_CTRL_SELDACI_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define _ECAIF_CTRL_SELDACI_Q_FIFO_0          0x00000000UL                              /**< Mode Q_FIFO_0 for ECAIF_CTRL                */
#define _ECAIF_CTRL_SELDACI_I_FIFO_0          0x00000001UL                              /**< Mode I_FIFO_0 for ECAIF_CTRL                */
#define _ECAIF_CTRL_SELDACI_Q_FIFO_1          0x00000002UL                              /**< Mode Q_FIFO_1 for ECAIF_CTRL                */
#define _ECAIF_CTRL_SELDACI_I_FIFO_1          0x00000003UL                              /**< Mode I_FIFO_1 for ECAIF_CTRL                */
#define ECAIF_CTRL_SELDACI_DEFAULT            (_ECAIF_CTRL_SELDACI_DEFAULT << 18)       /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define ECAIF_CTRL_SELDACI_Q_FIFO_0           (_ECAIF_CTRL_SELDACI_Q_FIFO_0 << 18)      /**< Shifted mode Q_FIFO_0 for ECAIF_CTRL        */
#define ECAIF_CTRL_SELDACI_I_FIFO_0           (_ECAIF_CTRL_SELDACI_I_FIFO_0 << 18)      /**< Shifted mode I_FIFO_0 for ECAIF_CTRL        */
#define ECAIF_CTRL_SELDACI_Q_FIFO_1           (_ECAIF_CTRL_SELDACI_Q_FIFO_1 << 18)      /**< Shifted mode Q_FIFO_1 for ECAIF_CTRL        */
#define ECAIF_CTRL_SELDACI_I_FIFO_1           (_ECAIF_CTRL_SELDACI_I_FIFO_1 << 18)      /**< Shifted mode I_FIFO_1 for ECAIF_CTRL        */
#define _ECAIF_CTRL_SELDACQ_SHIFT             20                                        /**< Shift value for ECAIF_SELDACQ               */
#define _ECAIF_CTRL_SELDACQ_MASK              0x300000UL                                /**< Bit mask for ECAIF_SELDACQ                  */
#define _ECAIF_CTRL_SELDACQ_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for ECAIF_CTRL                 */
#define _ECAIF_CTRL_SELDACQ_Q_FIFO_0          0x00000000UL                              /**< Mode Q_FIFO_0 for ECAIF_CTRL                */
#define _ECAIF_CTRL_SELDACQ_I_FIFO_0          0x00000001UL                              /**< Mode I_FIFO_0 for ECAIF_CTRL                */
#define _ECAIF_CTRL_SELDACQ_Q_FIFO_1          0x00000002UL                              /**< Mode Q_FIFO_1 for ECAIF_CTRL                */
#define _ECAIF_CTRL_SELDACQ_I_FIFO_1          0x00000003UL                              /**< Mode I_FIFO_1 for ECAIF_CTRL                */
#define ECAIF_CTRL_SELDACQ_DEFAULT            (_ECAIF_CTRL_SELDACQ_DEFAULT << 20)       /**< Shifted mode DEFAULT for ECAIF_CTRL         */
#define ECAIF_CTRL_SELDACQ_Q_FIFO_0           (_ECAIF_CTRL_SELDACQ_Q_FIFO_0 << 20)      /**< Shifted mode Q_FIFO_0 for ECAIF_CTRL        */
#define ECAIF_CTRL_SELDACQ_I_FIFO_0           (_ECAIF_CTRL_SELDACQ_I_FIFO_0 << 20)      /**< Shifted mode I_FIFO_0 for ECAIF_CTRL        */
#define ECAIF_CTRL_SELDACQ_Q_FIFO_1           (_ECAIF_CTRL_SELDACQ_Q_FIFO_1 << 20)      /**< Shifted mode Q_FIFO_1 for ECAIF_CTRL        */
#define ECAIF_CTRL_SELDACQ_I_FIFO_1           (_ECAIF_CTRL_SELDACQ_I_FIFO_1 << 20)      /**< Shifted mode I_FIFO_1 for ECAIF_CTRL        */

/** @} End of group EFR32FG25_ECAIF_BitFields */
/** @} End of group EFR32FG25_ECAIF */
/** @} End of group Parts */

#endif /* EFR32FG25_ECAIF_H */
